
/** 使用方法
  * 1.声明数个全局变量 sMENUITEM,将全部选项都初始化出来(不管是上级菜单还是子菜单)，并赋给数组(每个菜单对应一个数组)
  * 2.声明数个全局变量 sMENU,赋予对应的sMENUITEM数组，并填写菜单名称
  * 3.声明全局变量 sMENUSTATE,将MAX_ROWS初始化为需要的值,将第一
  *   个要显示(sMENU)的菜单赋给currentMenu,其余全部初始化为0
  */
  
#ifndef _MENU_H_
#define _MENU_H_

/************用于配合的头文件************/



/****************************************/

#define lcdMenu_callFunction(fp) ( ( *fp )( ) )

typedef struct sMENU sMENU;
typedef struct sMENUITEM sMENUITEM;
typedef struct sMENUSTATE sMENUSTATE;

/**********************************************************************************/
typedef struct sMENU
{
	char * name;							/* 菜单名 */
	uint8_t len;							/* 菜单内容总数 */
	sMENUITEM ** menuarr;					/* 菜单内容(数组) */
	uint8_t last_top;						/* 上级菜单的顶部是第几位 */
	uint8_t lastCurrItem;					/* 上级菜单选中的是第几个选项 */
	sMENU * parent;							/* 上级菜单 */
	
} sMENU;

/**********************************************************************************/
typedef struct sMENUITEM
{
	char * name;							/* 选项名 */
	void ( *Func_Handler )();				/* 选项功能 */
	sMENU * child;							/* 下级菜单 */
} sMENUITEM;

/**********************************************************************************/
typedef struct sMENUSTATE
{
	uint8_t top;							/* 当前显示菜单顶部是第几个 */
	uint8_t MAX_ROWS;						/* 一个屏幕最多显示几个选项 */
	uint8_t currItem;						/* 当前选中的是第几个选项 */
	sMENU * currMenu;						/* 当前显示的菜单 */
} sMENUSTATE;

/**********************************************************************************/
void Menu_goBack( sMENUSTATE * ms );
/**********************************************************************************/
void Menu_select( sMENUSTATE * ms );
/**********************************************************************************/
void Menu_goUp( sMENUSTATE * ms );
/**********************************************************************************/
void Menu_goDown( sMENUSTATE * ms );
/**********************************************************************************/
void LCD_drawMenu( sMENUSTATE * ms );
/***********************************************************************************
以下函数需要自己根据需要改写
***********************************************************************************/
void lcdMenu_clearScreen( void );
/**********************************************************************************/
void lcdMenu_printTitle( void );
/**********************************************************************************/
void lcdMenu_printSelect( void );
/**********************************************************************************/
void lcdMenu_printNormal( void );
/**********************************************************************************/

#endif
